/******************************************************************************
 * コントローラー関係に必要なヘッダーの読み込み
******************************************************************************/
#include "../../header/controller/controller.h"

/******************************************************************************
 * class Joystick
******************************************************************************/
Joystick::Joystick(const unsigned int controllerID)
{
    //コントローラーの初期化 IDは引数
}

ControllerParam Joystick::readStateController()
{
    ControllerParam param = *new ControllerParam();

    //ここに

    return param;
}

/******************************************************************************
 * class ControllerManager
******************************************************************************/