/******************************************************************************
 * Touple2f関係に必要なヘッダーの読み込み
******************************************************************************/
#include "./touple2f.h"
#include <cmath>
#include <stdio.h>

/******************************************************************************
 * Touple2f
******************************************************************************/
//コンストラクタ///////////////////////////////////////////////////////////////
Touple2f::Touple2f()
{
    this->x = 0;
    this->y = 0;
}
Touple2f::Touple2f(float x, float y)
{
    this->x = x;
    this->y = y;
}

//OverLoad///////////////////////////////////////////////////////////////
Touple2f Touple2f::operator=(Touple2f obj)
{
    this->x = obj.x;
    this->y = obj.y;
}

void Touple2f::callMe()
{
    printf("%4f\t%4f\n", this->x, this->y);
    printf("\n\n\n");
}